liuxu324/SIP_CBD1900078_D01_Tricore/CBD1900078_D01_Tricore/ThirdParty/Mcal_Tc3xx/Supply/MC-ISAR_AS42x_AURIX2G_TC38xA_TC39xB_BASIC_1.0.0-rc/DemoWorkspace/McalDemo/TC38A/0_Src/AppSw/Tricore/DemoMcal/Demo_Can_17_McmCan/Can_17_McmCan_Demo.c
/******************************************************************************                                        
**                                                                           **                                        
** Copyright (C) Infineon Technologies (2016)                                **                                        
**                                                                           **                                        
** All rights reserved.                                                      **                                        
**                                                                           **                                        
** This document contains proprietary information belonging to Infineon      **                                        
** Technologies. Passing on and copying of this document, and communication  **                                        
** of its contents is not permitted without prior written authorization.     **                                        
**                                                                           **                                        
*******************************************************************************                                        
**                                                                           **                                        
**  FILENAME   : Can_17_McmCan_Demo.c                                        **                                        
**                                                                           **                                        
**  VERSION    : 1.0.1                                                       **
**                                                                           **
**  DATE       : 2017-02-14                                                  **
**                                                                           **
**  VARIANT    : NA                                                          **
**                                                                           **
**  PLATFORM   : Infineon AURIX2G                                            **
**                                                                           **
**  AUTHOR      : DL-AUTOSAR-Engineering                                     **
**                                                                           **                                        
**  VENDOR      : Infineon Technologies                                      **                                        
**                                                                           **                                        
**  DESCRIPTION : This file contains                                         **                                        
**                - Demo application for CAN driver                          **                                        
**                                                                           **                                        
**  MAY BE CHANGED BY USER [yes/no]: Yes                                     **                                        
**                                                                           **                                        
******************************************************************************/                                        
                                                                                                                       
/*******************************************************************************                                       
**                      Includes                                              **                                       
*******************************************************************************/                                       
#include "IfxSrc_reg.h"
#include "Std_Types.h"                                                                                                 
#include "Irq.h"
#include "Can_17_McmCan_Demo.h"                                                                                         
#include "Can_17_McmCan.h"                                                                                              
#include "Test_Print.h"                                                                                                
/* Include the declarations of Can functions and types */
#include "SchM_Can_17_McmCan.h"
                                                                                                                       
/*******************************************************************************                                       
**                      Imported Compiler Switch Check                        **                                       
*******************************************************************************/                                       
                                                                                                                       
/*******************************************************************************                                       
**                      Private Macro Definitions                             **                                       
*******************************************************************************/                                       
#define CAN_SRC_SET_SRE                 (0x00000400U)
/* Set CLRR to clear SRR bit and disable SRE bit */
#define CAN_SRC_SET_CLRR_DISABLE_SRE     (0x52000000U)

/*******************************************************************************                                       
**                      Private Type Definitions                              **                                       
*******************************************************************************/                                       
                                                                                                                       
