liuxu324/SIP_CBD1900078_D01_Tricore/CBD1900078_D01_Tricore/ThirdParty/Mcal_Tc3xx/Supply/MC-ISAR_AS42x_AURIX2G_TC38xA_TC39xB_BASIC_1.0.0-rc/DemoWorkspace/McalDemo/TC38A/0_Src/AppSw/Tricore/DemoMcal/Demo_Can_17_McmCan/Can_17_McmCan_Demo.c
/*******************************************************************************                                       
**                      Private Function Declarations                         **                                       
*******************************************************************************/                                       
                                                                                                                       
/*******************************************************************************                                       
**                      Global Constant Definitions                           **                                       
*******************************************************************************/                                       
#define CAN_17_MCMCAN_START_SEC_CONFIG_DATA_QM_GLOBAL_UNSPECIFIED
#include "Can_17_McmCan_MemMap.h"

extern const Can_17_McmCan_ConfigType Can_17_McmCan_Config;                                                                                                                       

#define CAN_17_MCMCAN_STOP_SEC_CONFIG_DATA_QM_GLOBAL_UNSPECIFIED
#include "Can_17_McmCan_MemMap.h"

/*******************************************************************************                                       
**                      Global Variable Definitions                           **                                       
*******************************************************************************/                                       
                                                                                                  

uint32 SrcCan0Int[4]={0};
uint32 SrcCan1Int[4]={0};
uint8 CanRxDataBuff[20][64]={{0},{0}};
                                                                                               
                                                                                                                       
/* Global variables used for pass/fail criteria */                                                                     
uint8 Test_RxConfirmCount=0;                                                                                             
uint8 Test_TxConfirmCount=0;  
                                                                                                                       
/*******************************************************************************                                       
**                      Private Constant Definitions                          **                                       
*******************************************************************************/                                       
                                                                                                                       
                                                                                                
                                                                                                                       
/* Data Bytes For CAN Frame */                                                                                         
uint8 tx_data_1[][10] = {                                                                                              
    {0x01, 0x02, 0x03, 0x04, 0x05, 0x06, 0x07, 0x08 },                                                                 
    {0x11, 0x12, 0x13, 0x14, 0x15, 0x16, 0x17, 0x18 },                                                                 
    {0x21, 0x22, 0x23, 0x24, 0x25, 0x26, 0x27, 0x28 },                                                                 
    {0x31, 0x32, 0x33, 0x34, 0x35, 0x36, 0x37, 0x38 },                                                                 
    {0x41, 0x42, 0x43, 0x44, 0x45, 0x46, 0x47, 0x48 },                                                                 
    {0x51, 0x52, 0x53, 0x54, 0x55, 0x56, 0x57, 0x58 },                                                                 
    {0x61, 0x62, 0x63, 0x64, 0x65, 0x66, 0x67, 0x68 },                                                                 
    {0x71, 0x72, 0x73, 0x74, 0x75, 0x76, 0x77, 0x78 },                                                                 
    {0x81, 0x82, 0x83, 0x84, 0x85, 0x86, 0x87, 0x88 },                                                                 
    {0x91, 0x92, 0x93, 0x94, 0x95, 0x96, 0x97, 0x98 },                                                                 
    {0x01, 0x01, 0x01, 0x01, 0x01, 0x01, 0x01, 0x01 },                                                                 
    {0x11, 0x22, 0x33, 0x44, 0x44, 0x33, 0x22, 0x11 },                                                                 
    {0x91, 0x92, 0x93, 0x94, 0x95, 0x96, 0x97, 0x98 },                                                                 
} ;                                                                                                                    
/* Data Bytes For CAN FD Frame */                                                                                      
uint8 tx_data_Fd[][64] = {                                                                                             
    {0x01, 0x02, 0x03, 0x04, 0x05, 0x06, 0x07, 0x08, 0x09, 0xA, 0xB, 0xC},                                             
    {0x11, 0x22, 0x33, 0x44, 0x55, 0x66, 0x77, 0x88, 0x99, 0x11, 0x22, 0x33,                                           
  0x44, 0x55, 0x66, 0x77},                                                                                             
    {0x41, 0x22, 0x33, 0x44, 0x55, 0x66, 0x77, 0x88, 0x99, 0x11, 0x22, 0x33,                                           
  0x44, 0x55, 0x66, 0x77, 0x88, 0x99,0x01,0x02},                                                                       
    {0x39, 0x22, 0x33, 0x44, 0x55, 0x66, 0x77, 0x88, 0x99, 0x11, 0x22, 0x33,                                           
  0x44, 0x55, 0x66, 0x77, 0x88, 0x99,0x01,0x02,0x15,0x16,0x17,0x18, 0x91,                                              
  0x92, 0x93, 0x94, 0x95, 0x96, 0x97, 0x98}                                                                            
} ;                                                                                                                    

uint8 Can_Init_Status = 0;                                                                                            
                                                                                                                       
                                                                                                 
                                                                                                 
                                                                                                                       
