liuxu324/SIP_CBD1900078_D01_Tricore/CBD1900078_D01_Tricore/ThirdParty/Mcal_Tc3xx/Supply/MC-ISAR_AS42x_AURIX2G_TC38xA_TC39xB_BASIC_1.0.0-rc/DemoWorkspace/McalDemo/TC38A/0_Src/AppSw/Tricore/DemoMcal/Demo_Can_17_McmCan/Can_17_McmCan_Demo.c
/* CAN Frame PDU Info With Standard Identifier */                                                                      
Can_PduType PduInfo_1[] =                                                                                              
{                                                                                                                      
  {8,  8, 0x123, tx_data_1[0] },                                                                                       
  {12, 8, 0x111, tx_data_1[1] },                                                                                       
  {9,  8, 0x456, tx_data_1[2] },                                                                                       
  {13, 8, 0x222, tx_data_1[3] }                                                                                        
};                                                                                                                     
                                                                                                                       
/* CAN Frame PDU Info With Standard Identifier */                                                                      
Can_PduType PduInfo_2[] =                                                                                              
{                                                                                                                      
  {8,  8, 0x123, tx_data_1[0] },                                                                                       
  {12, 8, 0x111, tx_data_1[1] },                                                                                       
  {10,  8, 0x81111111, tx_data_1[2] },                                                                                  
  {13, 8, 0x222, tx_data_1[3] }                                                                                        
};                                                                                                                     
                                                                                                                       
/* CAN Frame PDU Info With Extended Identifier */                                                                      
Can_PduType PduInfo_ExtId[] =                                                                                          
{                                                                                                                      
  {10, 8, 0x8AAAAAAA, tx_data_1[4]},                                                                                   
  {14, 8, 0x81111111, tx_data_1[5]}                                                                                    
};                                                                                                                     
                                                                                                                       
/* CAN Frame PDU Info With Mixed Identifier */                                                                         
Can_PduType PduInfo_1_Mixed[] =                                                                                        
{                                                                                                                      
  {15, 8, 0x00C,      tx_data_1[6] },                                                                                  
  {15, 8, 0x80300000, tx_data_1[7] }                                                                                   
};                                                                                                                     
                                                                                                                       
Can_PduType PduInfo_2_Mixed[] =                                                                                        
{                                                                                                                      
  {11, 8, 0x00A,      tx_data_1[8] },                                                                                  
  {11, 8, 0x80280000, tx_data_1[9] }                                                                                   
};                                                                                                                     
                                                                                                                       
/* CAN Frame PDU Info for Wakeup */                                                                                    
Can_PduType PduInfo_Wakeup[] =                                                                                         
{                                                                                                                      
  {9,  8, 0x456, tx_data_1[11] },                                                                                      
  {13, 8, 0x80280000, tx_data_1[11] }                                                                                  
};                                                                                                                     
                                                                                                                       
/* CAN Frame PDU Info for Trigger transmit check */                                                                    
Can_PduType PduInfo_TriggerTransmit[] =                                                                                
{                                                                                                                      
  {20,  8, 0x123, tx_data_1[0] },                                                                                      
  {21, 8, 0x111, tx_data_1[0] },                                                                                       
  {22,  8, 0x456, tx_data_1[0] },                                                                                      
  {23, 8, 0x222, tx_data_1[0] }                                                                                        
};                                                                                                                     
                                                                                                                       
