liuxu324/SIP_CBD1900078_D01_Tricore/CBD1900078_D01_Tricore/ThirdParty/Mcal_Tc3xx/Supply/MC-ISAR_AS42x_AURIX2G_TC38xA_TC39xB_BASIC_1.0.0-rc/DemoWorkspace/McalDemo/TC38A/0_Src/AppSw/Tricore/DemoMcal/Demo_Can_17_McmCan/Can_17_McmCan_Demo.c
/* CAN Frame PDU Info for FD */                                                                                        
Can_PduType PduInfo_FD[] =                                                                                             
{                                                                                                                      
  {8,  12, 0x40000123, tx_data_Fd[0] },                                                                                
  {12, 16, 0x40000111, tx_data_Fd[1] },                                                                                
  {9,  20, 0x40000456, tx_data_Fd[2] },                                                                                
  {13, 32, 0x40000222, tx_data_Fd[3] }                                                                                 
};                                                                                                                     
                                                                                                                       
                                                                                                   
                                                                                                                       
/*******************************************************************************                                       
**                      Private Variable Definitions                          **                                       
*******************************************************************************/                                       
/*******************************************************************************                                       
**                      Private Function Declarations                         **                                       
*******************************************************************************/                                       
                                                                                                                       
#define CAN_17_MCMCAN_START_SEC_CODE_QM_GLOBAL                                                                                    
#include "Can_17_McmCan_MemMap.h"                                                                                                    
                                                                                                                       
static void Can_StandardFrameTx(void);                                                                                 
static void Can_ExtendedFrameTx(void);                                                                                 
static void Can_MixedModeSupport(void);                                                                                
static void Can_TestEnableDisableInterrupt(void);                                                                      
static void Can_SetBaudrateUsage(void);                                                                                
static void Can_IcomUsage(void);                                                                                       
static void Can_TriggerTransmitCheck(void);                                                                            
static void Can_FDMsgTxRx(void);                                                                                      
static void Can_EnableServiceRequest(uint8 node);                                                                                       
static void Can_DisableServiceRequest(uint8 node);                                                                                       
                                                                                                                       
#define CAN_17_MCMCAN_STOP_SEC_CODE_QM_GLOBAL                                                                                     
#include "Can_17_McmCan_MemMap.h"                                                                                                    
                                                                                                                       
/*******************************************************************************                                       
**                      Global Function Definitions                           **                                       
*******************************************************************************/                                       
                                                                                                                       
#define CAN_17_MCMCAN_START_SEC_CODE_QM_GLOBAL                                                                                    
#include "Can_17_McmCan_MemMap.h"                                                                                                    
                                                                                                                       
/*******************************************************************************                                       
** Syntax : void Can_17_McmCan_Demo (void)                                    **                                       
**                                                                            **                                       
** Service ID:   : NA                                                         **                                       
**                                                                            **                                       
** Sync/Async:   : Synchronous                                                **                                       
**                                                                            **                                       
** Reentrancy:   : Non Reentrant                                              **                                       
**                                                                            **                                       
** Parameters (in): none                                                      **                                       
**                                                                            **                                       
** Parameters (out): none                                                     **                                       
**                                                                            **                                       
** Return value: none                                                         **                                       
**                                                                            **                                       
** Description : DemoApp for CAN driver                                       **                                       
**                                                                            **                                       
*******************************************************************************/                                       
void Can_17_McmCan_Demo(void)                                                                                           
{                                                                                                                      
  char szString[80];                                                                                                   
  volatile uint8 TempUSage = 0;   
  
  if(!Can_Init_Status)
  {                                                                                   
    IrqCan_Init();
    Can_17_McmCan_Init(&Can_17_McmCan_Config);
    Can_EnableServiceRequest(2);
    Can_Init_Status++;
  }
                                                                                                                       
  while (!TempUSage)                                                                                                   
  {                                                                                                                    
    print_f("\n\n\n");                                                                                                 
    print_f("\n/*********************************************************/\n");                                        
    print_f("\n                CAN DRIVER DEMOAPP MENU                   \n ");                                        
    print_f("\n                                                          \n ");                                        
    print_f("     1.  Transfer of Standard Frame between CAN controllers \n ");                                        
    print_f("     2.  Transfer of Extended Frame between CAN controllers \n ");                                        
    print_f("     3.  Mixed Mode Support                                 \n ");                                        
    print_f("     4.  Check Enabling and Disabling of Tx and Rx Interrupts\n ");                                        
    print_f("     5.  Changing Baudrate using Can_SetBaudRate            \n ");                                        
    print_f("     6.  Activation and Deactivation of Pretended networking\n ");
    print_f("     7.  Trigger transmit functionality                     \n ");                                        
    print_f("     8.  FD frames transmission and reception               \n ");                                        
    print_f("     x.  Back To Main Menu                                  \n ");                                        
    print_f("                                                            \n ");                                        
    print_f("\n/*********************************************************/\n");                                        
    print_f("  Enter Your Option :: ");                                                                                
                                                                                                                       
