liuxu324/SIP_CBD1900078_D01_Tricore/CBD1900078_D01_Tricore/ThirdParty/Mcal_Tc3xx/Supply/MC-ISAR_AS42x_AURIX2G_TC38xA_TC39xB_BASIC_1.0.0-rc/DemoWorkspace/McalDemo/TC38A/0_Src/AppSw/Tricore/DemoMcal/Demo_Can_17_McmCan/Can_17_McmCan_Demo.c
    getline(szString, sizeof szString - 1);                                                                            
                                                                                                                       
    switch (*szString)                                                                                                 
    {                                                                                                                  
       case '1':                                                                                                       
       {                                                                                                               
           Can_StandardFrameTx();                                                                                      
           break;                                                                                                      
       }                                                                                                               
       case '2' :                                                                                                      
       {                                                                                                               
           Can_ExtendedFrameTx();                                                                                      
           break;                                                                                                      
       }                                                                                                               
       case '3' :                                                                                                      
       {                                                                                                               
           Can_MixedModeSupport();                                                                                     
           break;                                                                                                      
       }                                                                                                               
       case '4' :                                                                                                      
       {                                                                                                               
           Can_TestEnableDisableInterrupt();                                                                           
           break;                                                                                                      
       }                                                                                                               
       case '5' :                                                                                                      
       {                                                                                                               
           Can_SetBaudrateUsage();                                                                                     
           break;                                                                                                      
       }                                                                                                               
       case '6' :                                                                                                      
       {                                                                                                               
           Can_IcomUsage();                                                                                            
           break;                                                                                                      
       }                                                                                                               
       case '7' :                                                                                                      
       {                                                                                                               
           Can_TriggerTransmitCheck();                                                                                 
           break;                                                                                                      
       }                                                                                                               
       case '8' :                                                                                                      
       {                                                                                                               
           Can_FDMsgTxRx();                                                                                           
           break;                                                                                                      
       }                                                                                                               
       case 'x':                                                                                                       
       case 'X':                                                                                                       
         TempUSage = 1;                                                                                                
         break;                                                                                                        
       default :                                                                                                       
         print_f(" \n\n Invalid option \n ");  
		 StartResult();
		print_f("Result = Fail;");
		EndResult(); 
       break;                                                                                                          
    }                                                                                                                  
  }                                                                                                                    
}/* Can_17_McmCan_Demo() */                                                                                             
                                                                                                                       
