liuxu324/SIP_CBD1900078_D01_Tricore/CBD1900078_D01_Tricore/ThirdParty/Mcal_Tc3xx/Supply/MC-ISAR_AS42x_AURIX2G_TC38xA_TC39xB_BASIC_1.0.0-rc/DemoWorkspace/McalDemo/TC38A/0_Src/AppSw/Tricore/DemoMcal/Demo_Can_17_McmCan/Can_17_McmCan_Demo.c
/*******************************************************************************                                       
** Syntax : static void Can_MixedModeSupport(void)                            **                                       
**                                                                            **                                       
** Service ID:   : NA                                                         **                                       
**                                                                            **                                       
** Sync/Async:   : Synchronous                                                **                                       
**                                                                            **                                       
** Reentrancy:   : Non Reentrant                                              **                                       
**                                                                            **                                       
** Parameters (in): none                                                      **                                       
**                                                                            **                                       
** Parameters (out): none                                                     **                                       
**                                                                            **                                       
** Return value: none                                                         **                                       
**                                                                            **                                       
** Description : Transmission and Reception of CAN frames with Mixed Id       **                                       
**                                                                            **                                       
*******************************************************************************/                                       
static void Can_MixedModeSupport(void)                                                                                 
{                                                                                                                      
  volatile uint32 Counter;                                                                                             
  uint8 Test_TxCount = 0,TxRxDataMismatch=0;    
  uint16 i;
  uint16 j;   
                                                                                                                       
  Test_TxConfirmCount = 0;                                                                                             
  Test_RxConfirmCount = 0;                                                                                             
                                                                                                                       
  /* Put the CAN controllers into started state */                                                                     
  Can_17_McmCan_SetControllerMode (Can_17_McmCanConf_CanController_CanController_0, CAN_T_START);                      
  Can_17_McmCan_SetControllerMode (Can_17_McmCanConf_CanController_CanController_1, CAN_T_START);                      
                                                                                                                       
  print_f("\n------------------------------------------------------\n");                                               
  print_f(" Mixed Id Message Transfer Between Controller 0 and 1 \n");                                                 
  print_f("------------------------------------------------------\n");                                                 
                                                                                                                       
  /* Data transmission by Controller 1 to 0 */                                                                         
  print_f("\n Standard Id Message Transfer From Controller 1 to 0 \n");                                                
  Can_17_McmCan_Write(15, &PduInfo_1_Mixed[0]) ;                                                                        
                                                                                                                       
  /* Increment transmit counter */                                                                                     
  Test_TxCount++ ;                                                                                                     
                                                                                                                       
  /* Delay */                                                                                                          
  Counter = 0x5FFFF;                                                                                                   
  while(Counter--) ;                                                                                                   
                                                                                                                       
  #if (CAN_17_MCMCAN_TX_POLLING_PROCESSING == STD_ON)                                                                
  Can_17_McmCan_MainFunction_Write();                                                                                   
  #endif                                                                                                               
  #if (CAN_17_MCMCAN_RX_POLLING_PROCESSING == STD_ON)                                                               
  Can_17_McmCan_MainFunction_Read();                                                                                    
  #endif                                                                                                               
                                                                                                                       
  /* Data transmission by Controller 1 to 0 */                                                                         
  print_f("\n Extended Id Message Transfer From Controller 1 to 0 \n");                                                
  Can_17_McmCan_Write(15, &PduInfo_1_Mixed[1]) ;                                                                        
                                                                                                                       
  /* Increment transmit counter */                                                                                     
  Test_TxCount++ ;                                                                                                     
                                                                                                                       
  /* Delay */                                                                                                          
  Counter = 0x5FFFF;                                                                                                   
  while(Counter--) ;                                                                                                   
                                                                                                                       
  #if (CAN_17_MCMCAN_TX_POLLING_PROCESSING == STD_ON)                                                                  
  Can_17_McmCan_MainFunction_Write();                                                                                   
  #endif                                                                                                               
  #if (CAN_17_MCMCAN_RX_POLLING_PROCESSING == STD_ON)                                                                 
  Can_17_McmCan_MainFunction_Read();                                                                                    
  #endif                                                                                                               
                                                                                                                       
  /* Data transmission by Controller 0 to 1 */                                                                         
  print_f("\n Standard Id Message Transfer From Controller 0 to 1 \n");                                                
  Can_17_McmCan_Write(11, &PduInfo_2_Mixed[0]) ;                                                                        
                                                                                                                       
  /* Increment transmit counter */                                                                                     
  Test_TxCount++ ;                                                                                                     
                                                                                                                       
  /* Delay */                                                                                                          
  Counter = 0x5FFFF;                                                                                                   
  while(Counter--) ;                                                                                                   
                                                                                                                       
  #if (CAN_17_MCMCAN_TX_POLLING_PROCESSING == STD_ON)                                                                
  Can_17_McmCan_MainFunction_Write();                                                                                   
  #endif                                                                                                               
  #if (CAN_17_MCMCAN_RX_POLLING_PROCESSING == STD_ON)                                                                 
  Can_17_McmCan_MainFunction_Read();                                                                                    
  #endif                                                                                                               
                                                                                                                       
  /* Data transmission by Controller 0 to 1 */                                                                         
  print_f("\n Extended Id Message Transfer From Controller 0 to 1 \n");                                                
  Can_17_McmCan_Write(11, &PduInfo_2_Mixed[1]) ;                                                                        
                                                                                                                       
  /* Increment transmit counter */                                                                                     
  Test_TxCount++ ;                                                                                                     
                                                                                                                       
  /* Delay */                                                                                                          
  Counter = 0x5FFFF;                                                                                                   
  while(Counter--) ;                                                                                                   
                                                                                                                       
  #if (CAN_17_MCMCAN_TX_POLLING_PROCESSING == STD_ON)                                                                 
  Can_17_McmCan_MainFunction_Write();                                                                                   
  #endif                                                                                                               
  #if (CAN_17_MCMCAN_RX_POLLING_PROCESSING == STD_ON)                                                                  
  Can_17_McmCan_MainFunction_Read();                                                                                    
  #endif                                                                                                               
                                                                                                                       
  /* Put the CAN controllers into stopped state */                                                                     
  Can_17_McmCan_SetControllerMode (Can_17_McmCanConf_CanController_CanController_0, CAN_T_STOP);                       
  Can_17_McmCan_SetControllerMode (Can_17_McmCanConf_CanController_CanController_1, CAN_T_STOP);         

	for ( i = 0 ; i < Test_TxCount ; i++)
	{
		for ( j = 0; j < 8 ; j++)
		{
			if ( CanRxDataBuff[i][j] == PduInfo_1_Mixed[i].sdu[j])
				continue;
			else
				TxRxDataMismatch = 1;
				break;
		}
	}  
                                                                                                                       
  if(((Test_TxConfirmCount!=Test_TxCount)||(Test_RxConfirmCount!=Test_TxCount))&& TxRxDataMismatch)                                         
  {                                                                                                                    
    print_f("\nCAN message transfer didn't happen. \n");                                                               
    print_f("Number of transmits = %d \n", Test_TxCount);                                                              
    print_f("Number of transmit confirmations = %d \n", Test_TxConfirmCount);                                          
    print_f("Number of receive indications = %d \n", Test_RxConfirmCount);                                             
    StartResult();
    print_f("Result = Fail;");
    EndResult();                                                                                     
  }                                                                                                                    
  else                                                                                                                 
  {                                                                                                                    
    print_f("\nNumber of transmits = %d \n", Test_TxCount);                                                            
    print_f("Number of transmit confirmations = %d \n", Test_TxConfirmCount);                                          
    print_f("Number of receive indications = %d \n", Test_RxConfirmCount);                                             
    StartResult();
    print_f("Result = Pass;");
    EndResult();                                                                                   
  } 
  
	for ( i = 0 ; i < Test_TxCount ; i++)
	{
		for ( j = 0; j < 8 ; j++)
		{
			CanRxDataBuff[i][j] = 0;
		}
	}   
}                                                                                                                      
                                                                                                                       
