liuxu324/SIP_CBD1900078_D01_Tricore/CBD1900078_D01_Tricore/ThirdParty/Mcal_Tc3xx/Supply/MC-ISAR_AS42x_AURIX2G_TC38xA_TC39xB_BASIC_1.0.0-rc/DemoWorkspace/McalDemo/TC38A/0_Src/AppSw/Tricore/DemoMcal/Demo_Can_17_McmCan/Can_17_McmCan_Demo.c
/*******************************************************************************                                       
** Syntax : static void Can_TestEnableDisableInterrupt(void)                  **                                       
**                                                                            **                                       
** Service ID:   : NA                                                         **                                       
**                                                                            **                                       
** Sync/Async:   : Synchronous                                                **                                       
**                                                                            **                                       
** Reentrancy:   : Non Reentrant                                              **                                       
**                                                                            **                                       
** Parameters (in): none                                                      **                                       
**                                                                            **                                       
** Parameters (out): none                                                     **                                       
**                                                                            **                                       
** Return value: none                                                         **                                       
**                                                                            **                                       
** Description : Usage of Can_17_McmCan_DisableControllerInterrupts and        **                                       
**               Can_17_McmCan_EnableControllerInterrupts APIs                 **                                       
**                                                                            **                                       
*******************************************************************************/                                       
static void Can_TestEnableDisableInterrupt(void)                                                                       
{                                                                                                                      
#if((CAN_17_MCMCAN_TX_INTERRUPT_PROCESSING == STD_ON)&&(CAN_17_MCMCAN_RX_INTERRUPT_PROCESSING == STD_ON))                                                                
                                                                                                                       
  volatile uint32 Counter;                                                                                             
  uint8 DemoResult_2_Failed = 0;                                                                                       
  uint8 DemoDisableInt_Cntr[16] = {0};                                                                                       
                                                                                                                       
  Test_TxConfirmCount = 0;                                                                                             
  Test_RxConfirmCount = 0;                                                                                             
                                                                                                                       
  /* Put the CAN controllers into started state */                                                                     
  Can_17_McmCan_SetControllerMode (Can_17_McmCanConf_CanController_CanController_0, CAN_T_START);                      
  Can_17_McmCan_SetControllerMode (Can_17_McmCanConf_CanController_CanController_1, CAN_T_START);                      
                                                                                                                       
  print_f("\n---------------------------------------------\n");                                                        
  print_f(" Usage of APIs \n");                                                                                        
  print_f(" \t- Can_17_McmCan_DisableControllerInterrupts \n");                                                         
  print_f(" \t- Can_17_McmCan_EnableControllerInterrupts \n");                                                          
  print_f("---------------------------------------------\n");                                                          
                                                                                                                       
  print_f("\n Disabling Controller 0 interrupts... \n");                                                               
  Can_17_McmCan_DisableControllerInterrupts(Can_17_McmCanConf_CanController_CanController_0);

  DemoDisableInt_Cntr[Can_17_McmCanConf_CanController_CanController_0]++;

  if( 1U == DemoDisableInt_Cntr[Can_17_McmCanConf_CanController_CanController_0])
  {
    Can_DisableServiceRequest(Can_17_McmCanConf_CanController_CanController_0);
  }
                            
                                                                                                                       
  print_f("\n Disabling Controller 0 interrupts one more time \n");                                                    
  Can_17_McmCan_DisableControllerInterrupts(Can_17_McmCanConf_CanController_CanController_0);                          

  DemoDisableInt_Cntr[Can_17_McmCanConf_CanController_CanController_0]++;                          

  if( 1U == DemoDisableInt_Cntr[Can_17_McmCanConf_CanController_CanController_0])
  {
    Can_DisableServiceRequest(Can_17_McmCanConf_CanController_CanController_0);
  }
                                                                                                                       
  print_f("\n Controller 1 transmitting a message to Controller 0\n");                                                 
  print_f("\n No receive indication expected now\n");                                                                  
                                                                                                                       
  /* Controller 1 sends a message */                                                                                   
  Can_17_McmCan_Write(12, &PduInfo_1[1]) ;                                                                              
                                                                                                                       
  /* Delay */                                                                                                          
  Counter = 0x5FFFF;                                                                                                   
  while(Counter--) ;                                                                                                   
                                                                                                                       
