liuxu324/SIP_CBD1900078_D01_Tricore/CBD1900078_D01_Tricore/ThirdParty/Mcal_Tc3xx/Supply/MC-ISAR_AS42x_AURIX2G_TC38xA_TC39xB_BASIC_1.0.0-rc/DemoWorkspace/McalDemo/TC38A/0_Src/AppSw/Tricore/DemoMcal/Demo_Can_17_McmCan/Can_17_McmCan_Demo.c
  if((Test_TxConfirmCount != 1 ) || (Test_RxConfirmCount != 0))                                                        
  {                                                                                                                    
    DemoResult_2_Failed++ ;                                                                                            
  }                                                                                                                    
                                                                                                                       
  print_f("\n Controller 0 transmitting a message to Controller 1\n");                                                 
  print_f("\n No transmit indication expected now\n");                                                                 
                                                                                                                       
  /* Controller 0 sends a message */                                                                                   
  Can_17_McmCan_Write(8, &PduInfo_1[0]) ;                                                                               
                                                                                                                       
  /* Delay */                                                                                                          
  Counter = 0x5FFFF;                                                                                                   
  while(Counter--) ;                                                                                                   
                                                                                                                       
  if((Test_TxConfirmCount != 1 ) || (Test_RxConfirmCount != 1))                                                        
  {                                                                                                                    
    DemoResult_2_Failed++ ;                                                                                            
  }                                                                                                                    
                                                                                                                       
  print_f("\n Disabling Controller 1 interrupts... ");                                                                 
  Can_17_McmCan_DisableControllerInterrupts(Can_17_McmCanConf_CanController_CanController_1);                          

  DemoDisableInt_Cntr[Can_17_McmCanConf_CanController_CanController_1]++;                          

  if( 1U == DemoDisableInt_Cntr[Can_17_McmCanConf_CanController_CanController_1])
  {
    Can_DisableServiceRequest(Can_17_McmCanConf_CanController_CanController_1);
  }
                                                                                                                       
  print_f("\n Disabling Controller 1 interrupts one more time ");                                                      
  Can_17_McmCan_DisableControllerInterrupts(Can_17_McmCanConf_CanController_CanController_1);                          

  DemoDisableInt_Cntr[Can_17_McmCanConf_CanController_CanController_1]++;                          

  if( 1U == DemoDisableInt_Cntr[Can_17_McmCanConf_CanController_CanController_1])
  {
    Can_DisableServiceRequest(Can_17_McmCanConf_CanController_CanController_1);
  }
                                                                                                                       
  print_f("\n No transmit and receive indications expected now\n");                                                    
                                                                                                                       
  print_f("\n Controller 1 transmitting a message to Controller 0\n");                                                 
                                                                                                                       
  /* Controller 1 sends a message */                                                                                   
  Can_17_McmCan_Write(9, &PduInfo_1[2]) ;                                                                               
                                                                                                                       
  print_f("\n Controller 0 transmitting a message to Controller 1\n");                                                 
                                                                                                                       
  /* Controller 0 sends a message */                                                                                   
  Can_17_McmCan_Write(13, &PduInfo_1[3]) ;                                                                              
                                                                                                                       
  /* Delay */                                                                                                          
  Counter = 0x5FFFF;                                                                                                   
  while(Counter--) ;                                                                                                   
                                                                                                                       
  if((Test_TxConfirmCount != 1 ) || (Test_RxConfirmCount != 1))                                                        
  {                                                                                                                    
    DemoResult_2_Failed++ ;                                                                                            
  }                                                                                                                    
                                                                                                                       
  print_f("\n Enabling interrupts ONCE for both controllers... ");                                                     
  Can_17_McmCan_EnableControllerInterrupts(Can_17_McmCanConf_CanController_CanController_0);                           

  DemoDisableInt_Cntr[Can_17_McmCanConf_CanController_CanController_0]--;
  
  if(!(DemoDisableInt_Cntr[Can_17_McmCanConf_CanController_CanController_0]))
  {
    Can_EnableServiceRequest(Can_17_McmCanConf_CanController_CanController_0);
  }
                                
