liuxu324/SIP_CBD1900078_D01_Tricore/CBD1900078_D01_Tricore/ThirdParty/Mcal_Tc3xx/Supply/MC-ISAR_AS42x_AURIX2G_TC38xA_TC39xB_BASIC_1.0.0-rc/DemoWorkspace/McalDemo/TC38A/0_Src/AppSw/Tricore/DemoMcal/Demo_Can_17_McmCan/Can_17_McmCan_Demo.c
  Can_17_McmCan_EnableControllerInterrupts(Can_17_McmCanConf_CanController_CanController_1);                           

  DemoDisableInt_Cntr[Can_17_McmCanConf_CanController_CanController_1]--;
  
  if(!(DemoDisableInt_Cntr[Can_17_McmCanConf_CanController_CanController_1]))
  {
    Can_EnableServiceRequest(Can_17_McmCanConf_CanController_CanController_1);
  }
                                                                                                                       
  print_f("\n Still there SHOULDN'T be any transmit or recieve indications");                                          
                                                                                                                       
  print_f("\n Controller 1 is transmitting a message to Controller 0\n");                                              
                                                                                                                       
  /* Controller 1 sends a message */                                                                                   
  Can_17_McmCan_Write(14, &PduInfo_ExtId[1]) ;                                                                          
                                                                                                                       
  /* Delay */                                                                                                          
  Counter = 0x5FFFF;                                                                                                   
  while(Counter--) ;                                                                                                   
                                                                                                                       
  print_f("\n Controller 0 is transmitting a message to Controller 1\n");                                              
                                                                                                                       
  /* Controller 0 sends a message */                                                                                   
  Can_17_McmCan_Write(10, &PduInfo_ExtId[0]) ;                                                                          
                                                                                                                       
  /* Delay */                                                                                                          
  Counter = 0x5FFFF;                                                                                                   
  while(Counter--) ;                                                                                                   
                                                                                                                       
  if((Test_TxConfirmCount != 1 ) || (Test_RxConfirmCount != 1))                                                        
  {                                                                                                                    
    DemoResult_2_Failed++ ;                                                                                            
  }                                                                                                                    
                                                                                                                       
  print_f("\n Enabling interrupts SECOND TIME for both controllers... ");                                              
  Can_17_McmCan_EnableControllerInterrupts(Can_17_McmCanConf_CanController_CanController_0);                           

  DemoDisableInt_Cntr[Can_17_McmCanConf_CanController_CanController_0]--;
  
  if(!(DemoDisableInt_Cntr[Can_17_McmCanConf_CanController_CanController_0]))
  {
    Can_EnableServiceRequest(Can_17_McmCanConf_CanController_CanController_0);
  }

  Can_17_McmCan_EnableControllerInterrupts(Can_17_McmCanConf_CanController_CanController_1);                           

  DemoDisableInt_Cntr[Can_17_McmCanConf_CanController_CanController_1]--;
  
  if(!(DemoDisableInt_Cntr[Can_17_McmCanConf_CanController_CanController_1]))
  {
    Can_EnableServiceRequest(Can_17_McmCanConf_CanController_CanController_1);
  }
                                                                                                                       
  print_f("\n Pending transmit ok and receive indications ARE expected now\n");                                        
                                                                                                                       
  /* Delay */                                                                                                          
  Counter = 0x5FFFF;                                                                                                   
  while(Counter--) ;                                                                                                   
                                                                                                                       
  if((Test_TxConfirmCount != 6 ) || (Test_RxConfirmCount != 6))                                                        
  {                                                                                                                    
    DemoResult_2_Failed++ ;                                                                                            
  }                                                                                                                    
                                                                                                                       
  print_f("\n\n Transmit and receive indications for new transmit requests");                                          
  print_f("\n are expected as usual now.\n");                                                                          
  print_f("\n Controller 1 is transmitting a message.\n");                                                             
                                                                                                                       
  /* Controller 1 sends a message */                                                                                   
  Can_17_McmCan_Write(12, &PduInfo_1[1]) ;                                                                              
                                                                                                                       
  /* Delay */                                                                                                          
  Counter = 0x5FFFF;                                                                                                   
  while(Counter--) ;                                                                                                   
                                                                                                                       
  if((Test_TxConfirmCount != 7 ) || (Test_RxConfirmCount != 7))                                                        
  {                                                                                                                    
    DemoResult_2_Failed++ ;                                                                                            
  }                                                                                                                    
                                                                                                                       
