liuxu324/SIP_CBD1900078_D01_Tricore/CBD1900078_D01_Tricore/ThirdParty/Mcal_Tc3xx/Supply/MC-ISAR_AS42x_AURIX2G_TC38xA_TC39xB_BASIC_1.0.0-rc/DemoWorkspace/McalDemo/TC38A/0_Src/AppSw/Tricore/DemoMcal/Demo_Can_17_McmCan/Can_17_McmCan_Demo.c
  print_f("\n Controller 0 is transmitting a message.\n");                                                             
                                                                                                                       
  /* Controller 0 sends a message */                                                                                   
  Can_17_McmCan_Write(8, &PduInfo_1[0]) ;                                                                               
                                                                                                                       
  /* Delay */                                                                                                          
  Counter = 0x5FFFF;                                                                                                   
  while(Counter--) ;                                                                                                   
                                                                                                                       
  /* Put the CAN controllers into stopped state */                                                                     
  Can_17_McmCan_SetControllerMode (Can_17_McmCanConf_CanController_CanController_0, CAN_T_STOP);                       
  Can_17_McmCan_SetControllerMode (Can_17_McmCanConf_CanController_CanController_1, CAN_T_STOP);                       
                                                                                                                       
  if((Test_TxConfirmCount != 8 ) || (Test_RxConfirmCount != 8))                                                        
  {                                                                                                                    
    DemoResult_2_Failed++ ;                                                                                            
  }                                                                                                                    
                                                                                                                       
  if(DemoResult_2_Failed)                                                                                              
  {                                                                                                                    
    StartResult();
    print_f("Result = Fail;");
    EndResult();                                                                                 
  }                                                                                                                    
  else                                                                                                                 
  {                                                                                                                    
    StartResult();
    print_f("Result = Pass;");
    EndResult();                                                                                 
  }                                                                                                                    
                                                                                                                       
#else                                                                                                                  
                                                                                                                       
  print_f("\n For CAN controllers 0 and 1, both Tx and Rx ");                                                          
  print_f("processing should be interrupt mode\n");                                                                    
                                                                                                                       
#endif                                                                                                                 
}                                                                                                                      
                                                                                                                  
/*******************************************************************************                                       
** Syntax : static void Can_SetBaudrateUsage(void)                            **                                       
**                                                                            **                                       
** Service ID:   : NA                                                         **                                       
**                                                                            **                                       
** Sync/Async:   : Synchronous                                                **                                       
**                                                                            **                                       
** Reentrancy:   : Non Reentrant                                              **                                       
**                                                                            **                                       
** Parameters (in): none                                                      **                                       
**                                                                            **                                       
** Parameters (out): none                                                     **                                       
**                                                                            **                                       
** Return value: none                                                         **                                       
**                                                                            **                                       
** Description : Usage of Can_17_McmCan_SetBaudrate for changing baudrate     **
**                                                                            **                                       
*******************************************************************************/                                       
static void Can_SetBaudrateUsage(void)                                                                                 
{                                                                                                                      
  volatile uint32 Counter;                                                                                             
  uint8 Test_TxCount = 0,TxRxDataMismatch=0;                                              
  uint16 i;
  uint16 j;                                                                                                   
                                                                                                                       
  Test_TxCount = 0;                                                                                                    
  Test_TxConfirmCount = 0;                                                                                             
  Test_RxConfirmCount = 0;                                                                                             
                                                                                                                       
  print_f(" \n\n Current CAN communication baudrate is 500kbps \n");                                                   
  print_f(" \n CAN controllers should be in STOPPED state while changing ");                                           
  print_f(" baudrate \n");                                                                                             
                                                                                                                       
  print_f(" \n Set the CAN controller state to STOPPED state \n");                                                     
  /* Put the CAN controllers into stopped state */                                                                     
  Can_17_McmCan_SetControllerMode (Can_17_McmCanConf_CanController_CanController_0, CAN_T_STOP);                       
  Can_17_McmCan_SetControllerMode (Can_17_McmCanConf_CanController_CanController_1, CAN_T_STOP);                       
                                                                                                                       
  print_f(" \n\n Change the CAN controllers baudrate to 1Mbps \n");                                                    
                                                                                                                       
  /* Set the baudrate */                                                                                               
#if (CAN_17_MCMCAN_SET_BAUDRATE_API == STD_ON)
  Can_17_McmCan_SetBaudrate(Can_17_McmCanConf_CanController_CanController_0, 1);                              
#endif                                                                                              
                                                                                                                       
  /* Set the baudrate */                                                                                               
#if (CAN_17_MCMCAN_SET_BAUDRATE_API == STD_ON)
  Can_17_McmCan_SetBaudrate(Can_17_McmCanConf_CanController_CanController_1, 1);                              
#endif                                                                                              
                                                                                         
                                                                                                                       
  print_f(" \n Set the CAN controller state to STARTED state \n");                                                     
  /* Put the CAN controllers into started state */                                                                     
  Can_17_McmCan_SetControllerMode (Can_17_McmCanConf_CanController_CanController_0, CAN_T_START);                      
  Can_17_McmCan_SetControllerMode (Can_17_McmCanConf_CanController_CanController_1, CAN_T_START);                      
                                                                                                                       
  print_f("\n---------------------------------------------------------\n");                                            
  print_f(" Standard Id Message Transfer Between Controller 0 and 1 \n");                                              
  print_f("---------------------------------------------------------\n");                                              
                                                                                                                       
  for (i=0; i<2; i++)                                                                                                  
  {                                                                                                                    
    /* Data transmission by Controller 0 to 1 */                                                                       
    print_f("\n Standard Id Message Transfer From Controller 0 to 1 \n");                                              
    Can_17_McmCan_Write(i+8, &PduInfo_1[i*2]) ;                                                                         
                                                                                                                       
    /* Increment transmit counter */                                                                                   
    Test_TxCount++ ;                                                                                                   
                                                                                                                       
    /* Delay */                                                                                                        
    Counter = 0x5FFFF;                                                                                                 
    while(Counter--) ;                                                                                                 
                                                                                                                       
    #if (CAN_17_MCMCAN_TX_POLLING_PROCESSING == STD_ON)                                                             
    Can_17_McmCan_MainFunction_Write();                                                                                 
    #endif                                                                                                             
    #if (CAN_17_MCMCAN_RX_POLLING_PROCESSING == STD_ON)                                                                
    Can_17_McmCan_MainFunction_Read();                                                                                  
    #endif                                                                                                             
                                                                                                                       
    /* Data transmission by Controller 1 to 0 */                                                                       
    print_f("\n Standard Id Message Transfer From Controller 1 to 0 \n");                                              
    Can_17_McmCan_Write(i+12, &PduInfo_1[(i*2)+1]) ;                                                                    
                                                                                                                       
    /* Increment transmit counter */                                                                                   
    Test_TxCount++ ;                                                                                                   
                                                                                                                       
    /* Delay */                                                                                                        
    Counter = 0x5FFFF;                                                                                                 
    while(Counter--) ;                                                                                                 
                                                                                                                       
    #if (CAN_17_MCMCAN_TX_POLLING_PROCESSING == STD_ON)                                                               
    Can_17_McmCan_MainFunction_Write();                                                                                 
    #endif                                                                                                             
    #if (CAN_17_MCMCAN_RX_POLLING_PROCESSING == STD_ON)                                                               
    Can_17_McmCan_MainFunction_Read();                                                                                  
    #endif                                                                                                             
  }                                                                                                                    
                                                                                                                       
  /* Delay */                                                                                                          
  Counter = 0x5FFFF;                                                                                                   
  while(Counter--) ;                                                                                                   
                                                                                                                       
  /* Put the CAN controllers into stopped state */                                                                     
  Can_17_McmCan_SetControllerMode (Can_17_McmCanConf_CanController_CanController_0, CAN_T_STOP);
  Can_17_McmCan_SetControllerMode (Can_17_McmCanConf_CanController_CanController_1, CAN_T_STOP);                       
                                                                                                                       
  print_f(" \n\n Change the CAN controllers baudrate back to 500kbps \n");
  
