liuxu324/SIP_CBD1900078_D01_Tricore/CBD1900078_D01_Tricore/ThirdParty/Mcal_Tc3xx/Supply/MC-ISAR_AS42x_AURIX2G_TC38xA_TC39xB_BASIC_1.0.0-rc/DemoWorkspace/McalDemo/TC38A/0_Src/AppSw/Tricore/DemoMcal/Demo_Can_17_McmCan/Can_17_McmCan_Demo.c
  /* Set the baudrate back to default configured values*/                                                                                               
#if (CAN_17_MCMCAN_SET_BAUDRATE_API == STD_ON)
  Can_17_McmCan_SetBaudrate(Can_17_McmCanConf_CanController_CanController_0, 0);                              
#endif
                                                                                                                     
  /* Set the baudrate back to default configured values*/                                                                                               
#if (CAN_17_MCMCAN_SET_BAUDRATE_API == STD_ON)
  Can_17_McmCan_SetBaudrate(Can_17_McmCanConf_CanController_CanController_1, 0);                              
#endif

	for ( i = 0 ; i < Test_TxCount ; i++)
	{
		for ( j = 0; j < 8 ; j++)
		{
			if ( CanRxDataBuff[i][j] == PduInfo_1[i].sdu[j])
				continue;
			else
				TxRxDataMismatch = 1;
				break;
		}
	}

  if(((Test_TxConfirmCount!=Test_TxCount)||(Test_RxConfirmCount!=Test_TxCount))&& TxRxDataMismatch)
  {                                                                                                                    
    print_f("\nCAN message transfer didn't happen. \n");                                                               
    print_f("Number of transmits = %d \n", Test_TxCount);                                                              
    print_f("Number of transmit confirmations = %d \n", Test_TxConfirmCount);                                          
    print_f("Number of receive indications = %d \n", Test_RxConfirmCount);                                             
    StartResult();
    print_f("Result = Fail;");
    EndResult();                                                                                    
  }                                                                                                                    
  else                                                                                                                 
  {                                                                                                                    
    print_f("\nNumber of transmits = %d \n", Test_TxCount);                                                            
    print_f("Number of transmit confirmations = %d \n", Test_TxConfirmCount);                                          
    print_f("Number of receive indications = %d \n", Test_RxConfirmCount);                                             
    StartResult();
    print_f("Result = Pass;");
    EndResult();                                                                                   
  }   

 	for ( i = 0 ; i < Test_TxCount ; i++)
	{
		for ( j = 0; j < 8 ; j++)
		{
			CanRxDataBuff[i][j] = 0;
		}
	} 
  
}                                                                                                                      
                                                                                                                       
/*******************************************************************************                                       
** Syntax : static void Can_IcomUsage(void)                                   **                                       
**                                                                            **                                       
** Service ID:   : NA                                                         **                                       
**                                                                            **                                       
** Sync/Async:   : Synchronous                                                **                                       
**                                                                            **                                       
** Reentrancy:   : Non Reentrant                                              **                                       
**                                                                            **                                       
** Parameters (in): none                                                      **                                       
**                                                                            **                                       
** Parameters (out): none                                                     **                                       
**                                                                            **                                       
** Return value: none                                                         **                                       
**                                                                            **                                       
** Description : Usage of Can_17_McmCan_SetIcomConfiguration for               **                                       
**               Activation/Deactivation of Pretended Networking              **                                       
**                                                                            **                                       
*******************************************************************************/                                       
static void Can_IcomUsage(void)                                                                                        
{                                                                                                                      
  volatile uint32 Counter;                                                                                             
  Can_ReturnType RetVal;                                                                                               
                                                                                                                       
  uint8 i;                                                                                                             
  uint8 Test_TxCount;                                                                                                  
                                                                                                                       
  Test_TxCount = 0;                                                                                                    
  Test_TxConfirmCount = 0;                                                                                             
  Test_RxConfirmCount = 0;                                                                                             
                                                                                                                       
  print_f(" \n Set the CAN controller state to STARTED state \n");                                                     
  /* Put the CAN controllers into started state */                                                                     
  Can_17_McmCan_SetControllerMode (Can_17_McmCanConf_CanController_CanController_0, CAN_T_START);                      
  Can_17_McmCan_SetControllerMode (Can_17_McmCanConf_CanController_CanController_1, CAN_T_START);                      
                                                                                                                       
  print_f(" \n\n Activate the Pretended Networking in CAN controller 1 \n");                                           
  /* Activate Pretended networking */                                                                                  
#if (CAN_17_MCMCAN_PUBLIC_ICOM_SUPPORT == STD_ON)
  Can_17_McmCan_SetIcomConfiguration (Can_17_McmCanConf_CanController_CanController_1, 1);                             
#endif
                                                                                                                       
  print_f("\n---------------------------------------------------------\n");                                            
  print_f(" Message Transfer Between Controller 0 and 1 \n");                                                          
  print_f("---------------------------------------------------------\n");                                              
                                                                                                                       
  for (i=0; i<2; i++)                                                                                                  
  {                                                                                                                    
    /* Data transmission by Controller 1 to 0 */                                                                       
    print_f("\n Standard Id Message Transfer From Controller 1 to 0 \n");                                              
    RetVal = Can_17_McmCan_Write(i+12, &PduInfo_1[(i*2)+1]) ;                                                           
                                                                                                                       
    if (CAN_BUSY == RetVal)                                                                                            
    {                                                                                                                  
      print_f("\n---------------------------------------------------------\n");                                        
      print_f(" CAN Write status for CAN controller 1 is CAN_BUSY. \n");                                               
      print_f(" Message transmission for CAN controller 1 is not possible when Pretended networking is activated  \n");
      print_f("---------------------------------------------------------\n");                                          
    }                                                                                                                  
                                                                                                                       
    /* Delay */                                                                                                        
    Counter = 0x5FFFF;                                                                                                 
    while(Counter--) ;                                                                                                 
                                                                                                                       
    #if (CAN_17_MCMCAN_TX_POLLING_PROCESSING == STD_ON)                                                                
    Can_17_McmCan_MainFunction_Write();                                                                                 
    #endif                                                                                                             
                                                                                                                       
    /* Data transmission by Controller 0 to 1 */                                                                       
    print_f("\n---------------------------------------------------------\n");                                          
    print_f(" Transmitting normal message from CAN controller 0 to 1  \n");                                            
    print_f("---------------------------------------------------------\n");                                            
    Can_17_McmCan_Write(i+9, &PduInfo_2[i*2]) ;                                                                         
                                                                                                                       
    /* Increment transmit counter */                                                                                   
    Test_TxCount++ ;                                                                                                   
                                                                                                                       
    /* Delay */                                                                                                        
    Counter = 0x5FFFF;                                                                                                 
    while(Counter--) ;                                                                                                 
                                                                                                                       
    #if (CAN_17_MCMCAN_TX_POLLING_PROCESSING == STD_ON)                                                                
    Can_17_McmCan_MainFunction_Write();                                                                                 
    #endif                                                                                                             
    #if (CAN_17_MCMCAN_RX_POLLING_PROCESSING == STD_ON)                                                                
    Can_17_McmCan_MainFunction_Read();                                                                                  
    #endif                                                                                                             
                                                                                                                       
    /* Data transmission by Controller 0 to 1 */                                                                       
    print_f("\n---------------------------------------------------------\n");                                          
    print_f(" Transmitting wakeup message from CAN controller 0 to 1  \n");                                            
    print_f("---------------------------------------------------------\n");                                            
    Can_17_McmCan_Write(9, &PduInfo_Wakeup[0]) ;                                                                    
                                                                                                                       
    /* Increment transmit counter */                                                                                   
    Test_TxCount++ ;                                                                                                   
                                                                                                                       
    /* Delay */                                                                                                        
    Counter = 0x5FFFF;                                                                                                 
    while(Counter--) ;                                                                                                 
                                                                                                                       
    #if (CAN_17_MCMCAN_TX_POLLING_PROCESSING == STD_ON)                                                                
    Can_17_McmCan_MainFunction_Write();                                                                                 
    #endif                                                                                                             
    #if (CAN_17_MCMCAN_RX_POLLING_PROCESSING == STD_ON)                                                                
    Can_17_McmCan_MainFunction_Read();                                                                                  
    #endif                                                                                                             
                                                                                                                       
