liuxu324/SIP_CBD1900078_D01_Tricore/CBD1900078_D01_Tricore/ThirdParty/Mcal_Tc3xx/Supply/MC-ISAR_AS42x_AURIX2G_TC38xA_TC39xB_BASIC_1.0.0-rc/DemoWorkspace/McalDemo/TC38A/0_Src/AppSw/Tricore/DemoMcal/Demo_Can_17_McmCan/Can_17_McmCan_Demo.c
} 

/*******************************************************************************                                       
** Syntax : static void Can_EnableServiceRequest(uint8 node)                  **                                       
**                                                                            **                                       
** Service ID:   : NA                                                         **                                       
**                                                                            **                                       
** Sync/Async:   : Synchronous                                                **                                       
**                                                                            **                                       
** Reentrancy:   : Non Reentrant                                              **                                       
**                                                                            **                                       
** Parameters (in): none                                                      **                                       
**                                                                            **                                       
** Parameters (out): none                                                     **                                       
**                                                                            **                                       
** Return value: none                                                         **                                       
**                                                                            **                                       
** Description : Enable Service Request for a particular Controller           **                                       
**                                                                            **                                       
*******************************************************************************/                                       
static void Can_EnableServiceRequest(uint8 node)                                                                                       
{
  /* Enter Critical Section */
  SchM_Enter_Can_17_McmCan_CanIntCtrl();

  if((0U == node)||(2U == node))
  {
    SRC_CAN_CAN0_INT0.U |= CAN_SRC_SET_SRE ;
    SRC_CAN_CAN0_INT1.U |= CAN_SRC_SET_SRE ;
    SRC_CAN_CAN0_INT2.U |= CAN_SRC_SET_SRE ;
    SRC_CAN_CAN0_INT3.U |= CAN_SRC_SET_SRE ;

    if(0U == node)
    {
      SRC_CAN_CAN0_INT0.U |= SrcCan0Int[0] ;
      SRC_CAN_CAN0_INT1.U |= SrcCan0Int[1] ;
      SRC_CAN_CAN0_INT2.U |= SrcCan0Int[2] ;
      SRC_CAN_CAN0_INT3.U |= SrcCan0Int[3] ;
    }
  }
  
  if((1U == node)||(2U == node))
  {
    SRC_CAN_CAN1_INT0.U |= CAN_SRC_SET_SRE ;
    SRC_CAN_CAN1_INT1.U |= CAN_SRC_SET_SRE ;
    SRC_CAN_CAN1_INT2.U |= CAN_SRC_SET_SRE ;
    SRC_CAN_CAN1_INT3.U |= CAN_SRC_SET_SRE ;

    if(1U == node)
    {
      SRC_CAN_CAN1_INT0.U |= SrcCan1Int[0] ;
      SRC_CAN_CAN1_INT1.U |= SrcCan1Int[1] ;
      SRC_CAN_CAN1_INT2.U |= SrcCan1Int[2] ;
      SRC_CAN_CAN1_INT3.U |= SrcCan1Int[3] ;
    }
  }

    /* Exit Critical Section */
   SchM_Exit_Can_17_McmCan_CanIntCtrl();
}   

/*******************************************************************************                                       
** Syntax : static void Can_DisableServiceRequest(uint8 node)                 **                                       
**                                                                            **                                       
** Service ID:   : NA                                                         **                                       
**                                                                            **                                       
** Sync/Async:   : Synchronous                                                **                                       
**                                                                            **                                       
** Reentrancy:   : Non Reentrant                                              **                                       
**                                                                            **                                       
** Parameters (in): none                                                      **                                       
**                                                                            **                                       
** Parameters (out): none                                                     **                                       
**                                                                            **                                       
** Return value: none                                                         **                                       
**                                                                            **                                       
** Description : Disable Service Request for a particular Controller          **                                       
**                                                                            **                                       
*******************************************************************************/                                       
static void Can_DisableServiceRequest(uint8 node)                                                                                       
{
    /* Enter Critical Section */
    SchM_Enter_Can_17_McmCan_CanIntCtrl();

  if((0U == node)||(2U == node))
  {
    SrcCan0Int[0] = SRC_CAN_CAN0_INT0.U ;
    SrcCan0Int[1] = SRC_CAN_CAN0_INT1.U ;
    SrcCan0Int[2] = SRC_CAN_CAN0_INT2.U ;
    SrcCan0Int[3] = SRC_CAN_CAN0_INT3.U ;

    SRC_CAN_CAN0_INT0.U = CAN_SRC_SET_CLRR_DISABLE_SRE ;
    SRC_CAN_CAN0_INT1.U = CAN_SRC_SET_CLRR_DISABLE_SRE ;
    SRC_CAN_CAN0_INT2.U = CAN_SRC_SET_CLRR_DISABLE_SRE ;
    SRC_CAN_CAN0_INT3.U = CAN_SRC_SET_CLRR_DISABLE_SRE ;
  }
  
  if((1U == node)||(2U == node))
  {
    SrcCan1Int[0] = SRC_CAN_CAN1_INT0.U ;
    SrcCan1Int[1] = SRC_CAN_CAN1_INT1.U ;
    SrcCan1Int[2] = SRC_CAN_CAN1_INT2.U ;
    SrcCan1Int[3] = SRC_CAN_CAN1_INT3.U ;

    SRC_CAN_CAN1_INT0.U = CAN_SRC_SET_CLRR_DISABLE_SRE ;
    SRC_CAN_CAN1_INT1.U = CAN_SRC_SET_CLRR_DISABLE_SRE ;
    SRC_CAN_CAN1_INT2.U = CAN_SRC_SET_CLRR_DISABLE_SRE ;
    SRC_CAN_CAN1_INT3.U = CAN_SRC_SET_CLRR_DISABLE_SRE ;
  }

  /* Exit Critical Section */
  SchM_Exit_Can_17_McmCan_CanIntCtrl();
}   
                                                                                                                
#define CAN_17_MCMCAN_STOP_SEC_CODE_QM_GLOBAL                                                                                     
#include "Can_17_McmCan_MemMap.h"
